
** Task 1
This week, there is a 30% probability that it will rain on any given day. At a certain high school, gym class is held on three days out of the five day school week.

On a school day, what is the probability that it is raining and the strudents have gym class?

Save your answer to the variable ~p_rain_and_gym~.

#+begin_src python :results output
  import numpy as np

  p_rain_and_gym = .3 * (3/5)

  print(p_rain_and_gym)

#+end_src

#+RESULTS:
: 0.18

** Script.py

#+begin_src python :results output
  import numpy as np

  p_disease_and_correct = (1.0 / 100000) * 0.99

  print(p_disease_and_correct)

  p_no_disease_and_incorrect = (99999.0 / 100000) * 0.01

  print(p_no_disease_and_incorrect)

#+end_src

#+RESULTS:
: 9.9e-06
: 0.0099999

** Script.py

#+begin_src python :results output
  import numpy as np

  p_positive_given_disease = 0.99

  p_disease = 1 / 100000

  p_positive = (1.0 / 100000.0 * 0.99) + (99999.0 / 100000 * 0.01)

  p_disease_given_positive = ((p_positive_given_disease * p_disease)) / p_positive

  print(p_disease_given_positive)

#+end_src

#+RESULTS:
: 0.0009890307498651321

** Script.py

#+begin_src python :results output
  import numpy as np

  p_spam = 0.2

  p_enhancement_given_spam = 0.05

  p_enhancement = 0.05 * 0.2 + 0.001 * (1 - 0.2)

  p_spam_enhancement = (p_enhancement_given_spam *  p_spam) / p_enhancement

  print(p_spam_enhancement)

#+end_src

#+RESULTS:
: 0.9259259259259259

** Script.py

#+begin_src python
  from reviews import neg_list, pos_list, neg_counter, pos_counter

  print(pos_list[0])
  print(neg_list[0])

  print(pos_counter['crib'])
  print(neg_counter['crib'])

#+end_src

#+RESULTS:
: Traceback (most recent call last):
:   File "<stdin>", line 2, in <module>
: _pickle.UnpicklingError: invalid load key, '\xef'.
: [ Babel evaluation exited with code 1 ]

